[
    {
        "title": "",
        "text": "He tama a John e hiahia ana ki te ako i te reo Māori. He kaha tona hiahia ki te ako i tēnei reo, ko tana tino kaupapa he rapu mātauranga mō ngā tūpuna Māori.\n\nI tētahi rā, ka whakaaro a John ki te ako i te reo Māori. I tīmata ia ki te ako i ngā kupu me ngā kīanga. I te atatū, ka haere ia ki te karaehe reo Māori.\n\nI roto i te akomanga, i ako a John ki te taha o ētahi atu tauira. I whakarongo ia ki ngā kōrero a ngā tauira reo Māori, i whakarongo anō ia ki ngā whakamārama a te kaiako.\n\nWhai muri i te kura, ka whakapau kaha a John ki te ako i te reo Māori. I kitea e ia ētahi huarahi ako hōu, pēnei i te pānui kupu hōu me te whakaharatau i ngā kōrero Māori me o hoa me te whānau.\n\nI te mutunga o te wiki, ka puta a John ki te whakaharatau i tana Māori ki te taha o ngā tangata o te hapori. I tēnei wā, i kitea e ia ngā kaupapa o te ao Māori me ngā momo whanaungatanga.\n\nMai i tērā rā, ka whakapau kaha a John ki te ako i te reo Māori. Heoi, he iti noa ngā kōrero reo Māori i roto i tana kura. Nō reira, i haere ia ki te kura e aro nui ana ki te reo Māori.\n\nI te kura, i whakapau kaha a John ki te ako i ngā tikanga Māori me ngā kaupapa hōu. I ako ia i ngā waiata, i ngā kēmu, i uru ki ngā whakataetae reo Māori. I haere anō ia ki ngā huihuinga whānau.\n\nI tēnei wā, he maha ngā kōrero a John i roto i te reo Māori. E mōhio ana ia ki te hiranga o te reo Māori, me tana hiahia ki te tirotiro i te ao Māori i roto i tana porowhita whakamarumaru.",
        "language": "",
        "image": "/images/story3.jpg"
    },
    {
        "title": "",
        "text": "Ka whiwhi kaupapa a Mark ki te whakapiki i te maunga i tona kāinga. I whakaaro ia, he mea whakahirahira, he mea whaihua. I whakaaro ia ka ea, engari kāhore ia e tika.\n\nHe rite tonu te huarahi whakarunga o te maunga, a ka mōhio a Mark he iti noa iho tona whakahaere i te tinana. Kei te aituā tona waewae, kei te hā haere, ka whiwhi ia i te hā. \"He aha i whakaaro ai ahau ka tino pai tēnei?\" te whakararuraru a ia ki a ia anō.\n\nI tana whakatūtū, ka huri te āhua o te āhuatanga ki a ia. I huna a ngā kapua whero, ā, kua whiwhi i te ua. Kahore i a Mark ngā taputapu tika, nā reira ka whakarukeruke. Makariri, whakakino ana, ka haere tonu a ia.\n\nI whakararuraru te whenua ārahi i ētahi wā. Ka whiwhi a Mark i ngā taha, ka whiwhi whakararuraru i ona ringa me ona waewae. Kāore i te haere tonu, he whawhai tonu.\n\nEngari he mea tino whakararuraru hoki e whakapau kaha ana a ia. Ka whakaaro ia ka whiwhi i te maunga, ka whakaū kaha ki a ia anō. Ko te whiwhi i te maunga, i te āwangawanga, i te whakakaha o tana haere tonu, ka whakakotahi tana whakapiki.\n\nI te whakapiki a Mark ka whakapau kaha ia ki te aroaro, ka whakaiti ngā kapua, a ka kite ia i te kitenga. He whakararuraru, he whiwhi i te eke ki runga. Ahakoa ngā whakararuraru, i puta ia. Ko te whakararuraru o te whiwhi ki te taumata i whakapau kaha ai tana whakawhiwhinga.",
        "language": "",
        "image": "/images/story1.jpg"
    },
    {
        "title": "",
        "text": "I pīrangi a Tom ki te whai haerenga i runga i tana poti i te awa. I whakaaro ia he rā ngahau ki te torotoro i ngā wāhi hōu. Engari he uaua ngā mea.\n\nHe pupuhi ngā wahanga o te awa ki te wai tere, me whakapau kaha a Tom kia kaua e paheke. \"He uaua ake tēnei i taku i whakaaro ai,\" ka kī ia, me te pupuri i tana hoe.\n\nEhara i te mea ngāwari te awa. Me karo a Tom i ngā manga iti e pā ana ki a ia, e whakararuraru ana ngā pepeke i a ia, e tino wera ana te rā. I tīmata ia ki te whakaaro mēnā he whakaaro pai tēnei.\n\nEngari i a ia e haere ana, ka kitea e ia ētahi wāhi hauhautanga i te taha o te awa. Ahakoa he uaua, nā te kite i ngā wāhi huna ka whai hua. Ehara i te mea ngāwari katoa, engari nā te kimi wāhi hōu ka haere tonu ia.\n\nKa mutu, ka tae atu a Tom ki tētahi wāhi marino o te awa. Ka heke te rā, ka mahana, ka pai ngā mea katoa. I te ngenge engari i te harikoa, ka noho ia i runga i tana poti, ka koa ki te wā rangimārie. Ahakoa he uaua, nā te tirotiro i ngā wāhi hōu i tino motuhake te haerenga.",
        "language": "",
        "image": "/images/story2.jpg"
    }
]